Repository: 3GA/make-snake
Catalog: po/*.po
Languages: es_ar

source: Press {{1 ENTER }} to try again.
es_ar: Aprieta {{1 ENTER }} para intentar de nuevo.

source: Board size (s | m | l)
es_ar: Tamaño del tablero (s | m | l)

source: Game speed (s | m | f)
es_ar: Velocidad del juego (s | m | f)

source: Number of lives (1 | 2 | 3 | 4 | 5 )
es_ar: Cantidad de vidas (1 | 2 | 3 | 4 | 5 )

source: Game themes (classic | minimal | jungle | 80s ) + custom themes
es_ar: Temas de juego (classic | minimal | jungle | 80s ) + temas personalizados

source: Print all available themes
es_ar: Imprimir todos los temas disponibles

source: Enter editor mode
es_ar: Abrir modo de editor

source: Closes game after game over
es_ar: Cierra el juego después de que se termine

source: Resets the game to challenge 1
es_ar: Restaura el juego al desafío 1

source: Share your favourite theme with the world
es_ar: Comparte tu tema favorita con el mundo

source: Welcome to SNAKE
es_ar: Bienvenido a SNAKE

source: Press [ENTER]
es_ar: Aprieta [ENTER]

source: Use [{0}{1}{2}{3}] to move
es_ar: Usa [{0}{1}{2}{3}] para moverte

source: GAME OVER
es_ar: FIN DEL JUEGO

source: Score:
es_ar: Puntuación:

source: Speed:
es_ar: Velocidad:

source: Size:
es_ar: Tamaño:

source: Lives:
es_ar: Vidas:

source: Press [ENTER] to exit
es_ar: Aprieta [ENTER] para salir

source: Press [ENTER] to continue
es_ar: Aprieta [ENTER] para continuar

source: score:
es_ar: puntuación:

source: lives:
es_ar: vidas:

source: Press Q to quit
es_ar: Aprieta Q para salir

source: Theme %s not found (names are case sensitive)
es_ar: No se encontró el tema %s (los nombres distinguen entre mayúsculas y minúsculas)

source: You need internet connection
es_ar: Necesitas estar conectado al Internet

source: You need to login to Kano World
es_ar: Necesitas iniciar sesión en Kano World

source: 1) Select a theme:
es_ar: 1) Elige un tema:

source: 2) Write a title:
es_ar: 2) Escribe un título:

source: 3) Write a description:
es_ar: 3) Escribe una descripción:

source: Sharing of {} failed. {}
es_ar: No se pudo compartir {}. {}

source: Take Screenshot [TAKEN]
es_ar: Capturar Pantalla [CAPTURADA]

source: Take Screenshot
es_ar: Capturar Pantalla

source: Black
es_ar: Negro

source: Red
es_ar: Rojo

source: Green
es_ar: Verde

source: Yellow
es_ar: Amarillo

source: Blue
es_ar: Azul

source: Cyan
es_ar: Cian

source: White
es_ar: Blanco

source: Back
es_ar: Volver

source: Background
es_ar: Fondo

source: Snake
es_ar: Serpiente

source: Apples
es_ar: Manzanas

source: Border
es_ar: Borde

source: Lives
es_ar: Vidas

source: Background symbol
es_ar: Símbolo para el fondo

source: Snake body
es_ar: Cuerpo de la serpiente

source: Apple symbol
es_ar: Símbolo para la manzana

source: Horizontal symbol
es_ar: Símbolo: muros horizontales

source: Vertical symbol
es_ar: Simbolo: muros verticales

source: Corner symbol
es_ar: Símbolo: esquinas

source: Lives symbol
es_ar: Símbolo de vidas

source: Press [ENTER]
es_ar: Apireta [ENTER]

source: Delete Theme
es_ar: Borrar Tema

source: Background colour
es_ar: Color de fondo

source: Symbol colour
es_ar: Color de símbolo

source: Do you really want to delete this theme?
es_ar: ¿Realmente quieres borrar este tema?

source: Yes
es_ar: Sí

source: Board
es_ar: Tablero

source: Elements
es_ar: Elementos

source: Choose a Name
es_ar: Elige un Nombre

source: New Theme
es_ar: Nuevo Tema

source: Saved Themes
es_ar: Temas Guardados

source: Exit
es_ar: Salir

source: {{6 - }} {{5 Need to enter a command: }} {{2 $commandstr }} {{5 or }} {{2 exit }}
es_ar: {{6 - }} {{5 Hay que ingresar un comando: }} {{2 $commandstr }} {{5 o }} {{2 exit }}

source: Type {{2 $commandstr }} then {{1 ENTER }}
es_ar: Escribe {{2 $commandstr }} luego aprieta {{1 ENTER }}

source: Fantastic! You gained {{2 $gained_exp }} experience points!
es_ar: ¡Muy bien! ¡Ganaste {{2 $gained_exp }} puntos de experiencia!

source: Where were we...
es_ar: Bien, ¿dónde estábamos?

source: {{3Challenge [1/9]: Let's play!}}
es_ar: {{3Desafío [1/9]: ¡Vamos!}}

source: Snake is one of the oldest and coolest games.
es_ar: Snake es uno de los juegos más antiguos y divertidos.

source: Eat apples, but don't bite your tail!
es_ar: Come las manzanas pero ¡no muerdas tu cola!

source: Press {{1 ENTER }} to see what you'll make!
es_ar: ¡Aprieta {{1 ENTER }} para ver lo que crearás!

source: {{3Challenge [2/9]: Your first spell}}
es_ar: {{3Desafío [2/9]: Tu primer hechizo}}

source: Ready to make it?
es_ar: ¿Estás listo para hacerlo?

source: Let's start simple.
es_ar: Empecemos por lo simple.

source: Type {{2 python snake }} then press {{1 ENTER }}.
es_ar: Escribe {{2 python snake }} luego aprieta {{1 ENTER }}.

source: This is a Linux command - a spell that your computer's brain understands.
es_ar: Éste es un comando de Linux - un hechizo que el cerebro de tu computadora entiende.

source: You can type {{2 exit }} at any point to quit.
es_ar: En cualquier momento, puedes escribir {{2 exit }} para salir.

source: {{3Challenge [3/9]: Game changer}}
es_ar: {{3Desafío [3/9]: Cambiar el Juego}}

source: Want to make the game tougher?
es_ar: ¿Quieres hacer el juego más difícil?

source: {{2 python snake }} launches the game.
es_ar: {{2 python snake }} inicia el juego.

source: But you can write parameters after {{2 python snake }} to change how the game works.
es_ar: Pero puedes escribir parámetros después de {{2 python snake }} para cambiar el funcionamiento del juego.

source: You can make the board medium size with {{2 python snake -b m }}
es_ar: Puedes hacer el tablero de tamaño mediano escribiendo {{2 python snake -b m }}

source: {{3Challenge [4/9]: Long live Snake}}
es_ar: {{3Desafío [4/9]: Viva la Serpiente!}}

source: Another way to change the game is to add extra lives!
es_ar: ¡Otra manera de cambiar el juego es añadir vidas extra!

source: You can add extra lives by adding {{2 --lives }} and a number after {{2 python snake }}.
es_ar: Puedes añadir vidas extra escribiendo {{2 --lives }} seguido por un número, después de {{2 python snake }}.

source: {{2 python snake }} is a command, and {{2 --lives }} is an argument.
es_ar: {{2 python snake }} es un comando y {{2 --lives }} es un parámetro.

source: Type {{2 python snake --lives 3 }} to make a game with three lives.
es_ar: Escribe Type {{2 python snake --lives 3 }} para crear un juego con tres vidas.

source: {{3Challenge [5/9]: Speed it up}}
es_ar: {{3Desafío [5/9]: Aceléralo}}

source: Another way to increase difficulty is by changing the Snake's speed.
es_ar: Otra manera de aumentar el nivel de dificultad es cambiar la velocidad de la serpiente.

source: We use the {{2 -s}} argument, with an {{2 f}} option to choose fast.
es_ar: Utilizamos el parámetro {{2 -s}}, junto con la opción {{2 f}} para elegir una velocidad rápida. F representa 'fast' que significa rápido en inglés.

source: Let's try a fast game! {{2 python snake -s f }}
es_ar: ¡Intentemos un juego rápido! {{2 python snake -s f }}

source: {{3Challenge [6/9]: Amazon style}}
es_ar: {{3Desafío [6/9]: Estilo amazona}}

source: You are changing Snake using computer commands.
es_ar: Estás modificando Snake usando comandos de computadora.

source: Now try modifying its theme (how Snake looks).
es_ar: Ahora intenta modificar el tema (la apariencia de Snake.)

source: Type {{2 python snake -t jungle }} to play Amazon style!
es_ar: ¡Escribe {{2 python snake -t jungle }} para jugarlo al estilo amazona!

source: {{3Challenge [7/9]: Make my own theme}}
es_ar: {{3Desafío [7/9]: Crear mi propio tema}}

source: Do you know you can even create your own themes?
es_ar: ¿Sabías que incluso puedes crear tus propios temas?

source: Type {{2 python snake -e }} to open the theme editor.
es_ar: Escribe {{2 python snake -e }} para abrir el editor de temas.

source: {{3Challenge [8/9]: Show your colours}}
es_ar: {{3Challenge [8/9]: Exhibe tus colores}}

source: It's looking good!
es_ar: ¡Se ve bien!

source: Type {{2 python snake -t $theme_name }} to play with the design that you saved in the editor.
es_ar: Escribe {{2 python snake -t $theme_name }} para jugarlo con el diseño que guardaste en el editor.

source: {{3Challenge [9/9]: Life saver}}
es_ar: {{3Desafío [9/9]: Salvavidas}}

source: Use the help option to learn all the different spells, with commands, arguments, and options.
es_ar: Usa la opción 'help' (ayuda) para aprender todos los hechizos, con comandos, parámetros y opciones.

source: Type {{2 python snake --help }} to get help.
es_ar: Escribe {{2 python snake --help }} para conseguir ayuda.

source: {{4 + }} {{3 Great! You've completed Make Snake!}}
es_ar: {4 + }} {{3 ¡Fenómeno! ¡Terminaste Make Snake!}}

source: Press {{1 ENTER }} to continue
es_ar: Aprieta {{1 ENTER }} para continuar

source: {{3Playground mode}}
es_ar: {{3Modo Playground}}

source: Try what you have learned, type {{2 python snake --help }} for help
es_ar: Prueba tus nuevas destrezas, escribe {{2 python snake --help }} para conseguir ayuda

source: {{4 + }} {{3 Make Snake has been reset, closing now...}}
es_ar: {{4 + }} {{3 Make Snake ha sido restablecido, cerrando el juego...}}

source: Remember: type {{2 python snake --help }} for help\n
es_ar: Recuerda: escribe {{2 python snake --help }} para conseguir ayuda\n

source: Need help? Type {{2 python snake --help }} or {{2 exit }} to finish.
es_ar: ¿Necesitas ayuda? Escribe {{2 python snake --help }} o {{2 exit }} para acabar.
